# JPerK Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..JPerK Property
SymbolTypeId Class See Also
---
Symbol J/K, indicating unit Joules per Kelvin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId JPerK { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JPerK As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JPerK {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace